Zhianan-creator/STM32F103-BQ76920-BMS-Firmware/User/Drivers/drv_softi2c_bq769x0.h
/*
 * Copyright (C) 2021-2099 PLKJ Development Team
 *
 * SPDX-License-Identifier: CC BY-NC 4.0
 *
 * http://creativecommons.org/licenses/by-nc/4.0/
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * Change Logs:
 * Date           Author            Notes
 * 2022-6-5       逍遥吾皇          the first version
 * 2022-6-18      逍遥吾皇          (1)重新对三元锂电池SOC对应电压数据表排*									(3)utils增加了二分查找算法用于开路SOC计算
 *									(2)修改了开路电压计算函数使之过程更清晰
 * 2022-7-2       逍遥吾皇          去掉查表方法,更新热敏电阻计算公式
 * 2023-1-5       逍遥吾皇          去掉了BQ769X0驱动的动态内存分*/
#ifndef __DRV_SOFTI2C_BQ769X0_H__
#define __DRV_SOFTI2C_BQ769X0_H__

#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include <stdlib.h>

#include "stm32f1xx_hal.h"
#include "cmsis_os2.h"
#include "FreeRTOS.h"
#include "task.h"


/*
 * BQ769X0 I2C从机地址(7位)
 *
 * BQ76920/30/40的默认I2C地址x08(7位)
 * 这个地址由芯片的CFETOFF引脚和化学ID决定
 * 如果你的电路中CFETOFF引脚被拉地址可能不同,请查数据手册
 */
#define BQ769X0_I2C_ADDR	0x08

/*
 * BQ769X0 CRC8多项* BQ769X0系列芯片使用CRC8校验保护I2C通信
 * 多项式为 x^8 + x^2 + x + 1 = 0x07
 * 每次读写寄存器都需要带上CRC校验字节
 */
#define CRC_KEY 0x07

/* 6位数据的位和*/
#define LOW_BYTE(Data)			(uint8_t)(0XFF & Data)
#define HIGH_BYTE(Data)			(uint8_t)(0XFF & (Data >> 8))

/*
 * BQ769X0毫秒延时* 原RT-Thread版本使用rt_thread_mdelay(),现改为CMSIS-RTOS2的osDelay()
 * osDelay()会让出CPU给其他任而不是忙等待
 * 用于: 唤醒延时(1000ms)、温度采样模式切换等2000ms)、初始化延时(500ms)
 */
#define BQ769X0_DELAY(ms)		osDelay(ms)


/*==========================================================================
 * 引脚配置
 *
 * 命名规则: BQ769X0_功能_GPIO_Port / BQ769X0_功能_Pin
 * 与HAL库的 GPIOx / GPIO_PIN_x 风格一*
 * TS1引脚(PA15) - 唤醒BQ芯片:
 *   BQ769X0在Ship模式(低功需要在TS1引脚上产生一个高电平脉冲唤醒
 *   唤醒后TS1引脚切回输入模式,用于温度采样(NTC热敏电阻)
 *   注意: PA15默认是JTDI调试引脚,需要在CubeMX中释*
 * ALERT引脚(PB12) - BQ芯片告警输出:
 *   BQ769X0检测到异常(OCD/SCD/OV/UVALERT引脚产生上升*   MCU通过外部中断(EXTI)捕获这个边沿,然后读取SYS_STAT寄存器确认具体告*========================================================================*/

/* BQ769X0唤醒引脚 - PA15 (需要在CubeMX中释放JTDI复用) */
#define BQ769X0_TS1_GPIO_Port	GPIOA
#define BQ769X0_TS1_Pin		GPIO_PIN_15

/* BQ769X0告警引脚 - PB12 (CubeMX中已配置为外部上升沿中断) */
#define BQ769X0_ALERT_GPIO_Port	GPIOB
#define BQ769X0_ALERT_Pin		GPIO_PIN_12
#define BQ769X0_ALERT_EXIT_IRQ	EXTI15_10_IRQn


/*==========================================================================
 * 电芯数量和温度通道配置
 *
 * BQ76920: 3~5串电1路温适合小型电池串电动工
 * BQ76930: 6~10串电2路温* BQ76940: 9~15串电3路温*
 * 这些宏用#ifndef包裹,可以在Keil预编译宏或上层头文件中覆* 例如在Keil的C/C++ -> Define中添BQ769X0_CELL_MAX=10
 *
 * BQ769X0_CELL_MAX - 支持的电芯串联数
 * BQ769X0_TMEP_MAX - 支持的温度通道注意:原作者拼写为TMEP,保持兼容)
 *========================================================================*/
#ifndef BQ769X0_CELL_MAX
#define BQ769X0_CELL_MAX 	5		/* BQ76920默认5串) */
#endif

#ifndef BQ769X0_TMEP_MAX
#define BQ769X0_TMEP_MAX	1		/* BQ76920默认1路温*/
#endif


/*==========================================================================
 * BQ769X0调试日志系统
 *
 * 与软件I2C的调试系统类使用printf输出
 * 需要将printf重定向到UART才能看到输出
 *
 * 等级0 - 全部关闭(默认,正式运行推荐)
 * 等级1 - 仅ERROR,用于定位I2C通信失败等严重问* 等级2 - 带文件名/函数行号,用于精确定位问题位置
 *========================================================================*/
#define BQ769X0_DEBUG_LEVEL	0


#if (BQ769X0_DEBUG_LEVEL == 0)

/* 等级0: 全部关闭,编译器会优化掉这些空*/
#define BQ769X0_ERROR(...)		do{}while(0)
#define BQ769X0_WARNING(...)	do{}while(0)
#define BQ769X0_INFO(...)		do{}while(0)

#elif (BQ769X0_DEBUG_LEVEL == 1)

/* 等级1: 仅显示错误信适合调试I2C通信问题 */
#define BQ769X0_ERROR(fmt, ...)                              \
		do                                                    \
        {                                                   \
            printf("[BQ769X0 ERROR]");                      \
            printf(fmt"\r\n", ##__VA_ARGS__);               \
        } while(0)
#define BQ769X0_WARNING(fmt, ...)                            \
		do                                                    \
        {                                                   \
            printf("[BQ769X0 WARNING]");                    \
            printf(fmt"\r\n", ##__VA_ARGS__);               \
        } while(0)
#define BQ769X0_INFO(fmt, ...)                               \
		do                                                    \
        {                                                   \
            printf("[BQ769X0 INFO]");                       \
            printf(fmt"\r\n", ##__VA_ARGS__);               \
        } while(0)


#elif (BQ769X0_DEBUG_LEVEL == 2)

/* 等级2: 带源码位置信适合精确定位问题 */
#define BQ769X0_ERROR(fmt, ...)                              \
		do                                                    \
        {                                                   \
            printf("[BQ769X0 ERROR][%s:%s:%d] ",            \
                    __FILE__, __FUNCTION__, __LINE__);      \
            printf(fmt"\r\n", ##__VA_ARGS__);               \
        } while(0)
#define BQ769X0_WARNING(fmt, ...)                            \
		do                                                    \
        {                                                   \
            printf("[BQ769X0 WARNING][%s:%s:%d] ",          \
                    __FILE__, __FUNCTION__, __LINE__);      \
            printf(fmt"\r\n", ##__VA_ARGS__);               \
        } while(0)
#define BQ769X0_INFO(fmt, ...)                               \
		do                                                    \
        {                                                   \
            printf("[BQ769X0 INFO][%s:%s:%d] ",             \
                    __FILE__, __FUNCTION__, __LINE__);      \
            printf(fmt"\r\n", ##__VA_ARGS__);               \
        } while(0)

#endif


/*==========================================================================
 * BQ769X0寄存器地址定义
 *
 * BQ769X0的寄存器分为以下几组:
 *   系统控制: SYS_STAT(0x00), SYS_CTRL1(0x04), SYS_CTRL2(0x05)
 *   均衡控制: CELLBAL1~3(0x01~0x03)
 *   保护配置: PROTECT1~3(0x06~0x08), OV_TRIP(0x09), UV_TRIP(0x0A)
 *   电压数据: VC1~VC15(从 0x0C开每节2字节), BAT(0x2A)
 *   温度数据: TS1(0x2C), TS2(0x2E)
 *   电流数据: CC(0x32~0x33,库仑
 *   校准数据: ADCGAIN1(0x50), ADCOFFSET(0x51), ADCGAIN2(0x59)
 *========================================================================*/

#define SYS_STAT 				0x00   /* 系统状态寄存器(告警标志*/
#define CELLBAL1 				0x01   /* 电芯均衡控制1(1~5号电*/
#define CELLBAL2 				0x02   /* 电芯均衡控制2(6~10号电*/
#define CELLBAL3 				0x03   /* 电芯均衡控制3(11~15号电*/
#define SYS_CTRL1 				0x04   /* 系统控制1(ADC使能、温度选择*/
#define SYS_CTRL2 				0x05   /* 系统控制2(CHG/DSG开关、库仑计*/
#define PROTECT1 				0x06   /* 保护配置1(SCD阈值和延时) */
#define PROTECT2 				0x07   /* 保护配置2(OCD阈值和延时) */
#define PROTECT3 				0x08   /* 保护配置3(OV/UV延时) */
#define OV_TRIP 				0x09   /* 过压保护阈*/
#define UV_TRIP 				0x0A   /* 欠压保护阈*/
#define CC_CFG  				0x0B   /* 库仑计配必须x19) */

