Zhianan-creator/STM32F103-BQ76920-BMS-Firmware/User/Drivers/drv_softi2c_bq769x0.h
/* 数据寄存只读) */
#define VC1_HI_BYTE	 			0x0C   /* 电芯1电压高字从这里连续读取所有电*/
#define CC_HI_BYTE				0x32   /* 库仑计高字节(电流采样*/
#define CC_LO_BYTE				0x33   /* 库仑计低字节 */
#define BAT_HI_BYTE				0x2A   /* 电池总电压高字节 */
#define TS1_HI_BYTE				0x2C   /* 温度传感高字*/
#define TS2_HI_BYTE				0x2E   /* 温度传感高字*/

/* 校准寄存只读) */
#define ADCGAIN1 				0x50   /* ADC增益寄存*/
#define ADCOFFSET 				0x51   /* ADC偏移寄存*/
#define ADCGAIN2 				0x59   /* ADC增益寄存*/


/*==========================================================================
 * 保护阈值定*
 * SCD(Short Circuit Detection) - 放电短路保护:
 *   当放电电流超过阈值时触发,阈值单位mV(分流电阻上的压降)
 *   例如: SCD_THRESH_89mV_44mV 表示RSNS=0时阈4mV,RSNS=1时阈9mV
 *   实际保护电流 = 阈mV) / 分流电阻(mΩ)
 *    44mV / 5mΩ = 8.8A
 *
 * OCD(Over Current Detection) - 放电过流保护:
 *   当放电电流持续超过阈值且超过延时时间时触*   例如: OCD_THRESH_22mV_11mV 表示RSNS=0时阈1mV
 *   实际保护电流 = 11mV / 5mΩ = 2.2A
 *========================================================================*/

#define SCD_THRESH_44mV_22mV	0x00
#define SCD_THRESH_67mV_33mV	0x01
#define SCD_THRESH_89mV_44mV	0x02
#define SCD_THRESH_111mV_56mV	0x03
#define SCD_THRESH_133mV_67mV	0x04
#define SCD_TRHESH_155mV_68mV	0x05
#define SCD_THRESH_178mV_89mV	0x06
#define SCD_THRESH_200mV_100mV	0x07

#define OCD_THRESH_17mV_8mV		0x00
#define OCD_THRESH_22mV_11mV	0x01
#define OCD_THRESH_28mV_14mV	0x02
#define OCD_THRESH_33mV_17mV	0x03
#define OCD_THRESH_39mV_19mV	0x04
#define OCD_THRESH_44mV_22mV	0x05
#define OCD_THRESH_50mV_25mV	0x06
#define OCD_THRESH_56mV_28MV	0x07
#define OCD_THRESH_61mV_31mV	0x08
#define OCD_THRESH_67mV_33mV	0x09
#define OCD_THRESH_72mV_36mV	0x0A
#define OCD_THRESH_78mV_39mV	0x0B
#define OCD_THRESH_83mV_42mV	0x0C
#define OCD_THRESH_89mV_44mV	0x0D
#define OCD_THRESH_94mV_47mV	0x0E
#define OCD_THRESH_100mV_50mV	0x0F


/*==========================================================================
 * OV/UV阈值计算常*
 * BQ769X0的OV/UV阈值寄存器位的,但实际比较是14位精* 写入格式: [10-XXXX-XXXX-1000] [01-XXXX-XXXX-0000]
 * OV_THRESH_BASE = 0x2008, UV_THRESH_BASE = 0x1000
 * OV/UV_STEP = 0x10 (每步对应一个ADC LSB)
 *
 * 计算公式:
 *   OV寄存器= ((OVP_mV / GAIN) - OV_THRESH_BASE) >> 4
 *   UV寄存器= ((UVP_mV / GAIN) - UV_THRESH_BASE) >> 4
 *========================================================================*/

#define OV_THRESH_BASE			0x2008
#define UV_THRESH_BASE			0x1000
#define OV_STEP					0x10
#define UV_STEP					0x10

/* ADCGAIN基准uV/LSB),实际增益需要加上寄存器中的修正*/
#define ADCGAIN_BASE			365


/*==========================================================================
 * SYS_STAT寄存器状态位定义
 *
 * SYS_STAT(0x00)是只读寄存器,记录BQ芯片检测到的各类告
 *   OCD   - 放电过流(Over Current Discharge)
 *   SCD   - 放电短路(Short Circuit Discharge)
 *   OV    - 过压(Over Voltage)
 *   UV    - 欠压(Under Voltage)
 *   OVRD  - ALERT引脚被外部电路强制触*   DEVICE - 芯片内部故障
 *   CC    - 库仑计采样完*
 * 写入1到对应位可以清除该告警标清零)
 *========================================================================*/

#define SYS_STAT_OCD_BIT		0X01   /* bit0: 放电过流 */
#define SYS_STAT_SCD_BIT		0X02   /* bit1: 放电短路 */
#define SYS_STAT_OV_BIT			0X04   /* bit2: 过压 */
#define SYS_STAT_UV_BIT			0X08   /* bit3: 欠压 */
#define SYS_STAT_OVRD_BIT		0X10   /* bit4: ALERT被外部覆*/
#define SYS_STAT_DEVICE_BIT		0X20   /* bit5: 设备故障 */
#define SYS_STAT_CC_BIT			0X80   /* bit7: 库仑计就*/


/*==========================================================================
 * 寄存器组结构- BQ769X0所有寄存器的内存镜*
 * 使用union+位域的方可以按字节访问也可以按位访问同一个寄存器
 * 例如: Registers.SysCtrl2.SysCtrl2Byte 可以直接写字节*       Registers.SysCtrl2.SysCtrl2Bit.CHG_ON 可以单独操作充电开关位
 *
 * 这个结构体在MCU侧维护一份寄存器镜像,读写BQ芯片时先修改镜像再批量写*========================================================================*/
typedef struct _Register_Group
{
	/* SYS_STAT(0x00) - 系统状只读,清零) */
	union
	{
		struct
		{
			uint8_t OCD				:1;  /* 放电过流标志 */
			uint8_t SCD				:1;  /* 放电短路标志 */
			uint8_t OV				:1;  /* 过压标志 */
			uint8_t UV				:1;  /* 欠压标志 */
			uint8_t OVRD_ALERT		:1;  /* ALERT被外部覆*/
			uint8_t DEVICE_XREADY	:1;  /* 设备故障 */
			uint8_t WAKE			:1;  /* 唤醒标志 */
			uint8_t CC_READY		:1;  /* 库仑计就*/
		}StatusBit;
		uint8_t StatusByte;
	}SysStatus;

	/* CELLBAL1(0x01) - 电芯均衡控制1(1~5号电*/
	union
	{
		struct
		{
			uint8_t RSVD		:3;  /* 保留*/
			uint8_t CB5			:1;  /* 5号电芯均衡开*/
			uint8_t CB4			:1;  /* 4号电芯均衡开*/
			uint8_t CB3			:1;  /* 3号电芯均衡开*/
			uint8_t CB2			:1;  /* 2号电芯均衡开*/
			uint8_t CB1			:1;  /* 1号电芯均衡开*/
		}CellBal1Bit;
		uint8_t CellBal1Byte;
	}CellBal1;

	/* CELLBAL2(0x02) - 电芯均衡控制2(6~10号电*/
	union
	{
		struct
		{
			uint8_t RSVD		:3;
			uint8_t CB10		:1;
			uint8_t CB9			:1;
			uint8_t CB8			:1;
			uint8_t CB7			:1;
			uint8_t CB6			:1;
		}CellBal2Bit;
		uint8_t CellBal2Byte;
	}CellBal2;

	/* CELLBAL3(0x03) - 电芯均衡控制3(11~15号电*/
	union
	{
		struct
		{
			uint8_t RSVD			:3;
			uint8_t CB15			:1;
			uint8_t CB14			:1;
			uint8_t CB13			:1;
			uint8_t CB12			:1;
			uint8_t CB11			:1;
		}CellBal3Bit;
		uint8_t CellBal3Byte;
	}CellBal3;

	/* SYS_CTRL1(0x04) - 系统控制1 */
	union
	{
		struct
		{
			uint8_t SHUT_B			:1;  /* 关机控制B */
			uint8_t SHUT_A			:1;  /* 关机控制A */
			uint8_t RSVD1			:1;
			uint8_t TEMP_SEL		:1;  /* 温度选择: 0=外部NTC, 1=内部die */
			uint8_t ADC_EN			:1;  /* ADC使能 */
			uint8_t RSVD2			:2;
			uint8_t LOAD_PRESENT	:1;  /* 负载检测标只读) */
		}SysCtrl1Bit;
		uint8_t SysCtrl1Byte;
	}SysCtrl1;

	/* SYS_CTRL2(0x05) - 系统控制2 */
	union
	{
		struct
		{
			uint8_t CHG_ON			:1;  /* 充电MOS开1=开, 0=否*/
			uint8_t DSG_ON			:1;  /* 放电MOS开1=开, 0=否*/
			uint8_t WAKE_T			:2;  /* 唤醒定时器配*/
			uint8_t WAKE_EN			:1;  /* 唤醒使能 */
			uint8_t CC_ONESHOT		:1;  /* 库仑计单次采*/
			uint8_t CC_EN			:1;  /* 库仑计连续采样使*/
			uint8_t DELAY_DIS		:1;  /* 禁用保护延时 */
		}SysCtrl2Bit;
		uint8_t SysCtrl2Byte;
	}SysCtrl2;

	/* PROTECT1(0x06) - 保护配置1(SCD) */
	union
	{
		struct
		{
			uint8_t SCD_THRESH		:3;  /* SCD阈8*/
			uint8_t SCD_DELAY		:2;  /* SCD延时(4*/
			uint8_t RSVD			:2;
			uint8_t RSNS			:1;  /* 分流电阻倍率: 0=不加1=加*/
		}Protect1Bit;
		uint8_t Protect1Byte;
	}Protect1;

	/* PROTECT2(0x07) - 保护配置2(OCD) */
	union
	{
		struct
		{
			uint8_t OCD_THRESH		:4;  /* OCD阈16*/
			uint8_t OCD_DELAY		:3;  /* OCD延时(8*/
			uint8_t RSVD			:1;
		}Protect2Bit;
		uint8_t Protect2Byte;
	}Protect2;

	/* PROTECT3(0x08) - 保护配置3(OV/UV延时) */
	union
	{
		struct
		{
			uint8_t RSVD			:4;
			uint8_t OV_DELAY		:2;  /* 过压延时(4位) */
			uint8_t UV_DELAY		:2;  /* 欠压延时(4位) */
		}Protect3Bit;
		uint8_t Protect3Byte;
	}Protect3;

	uint8_t OVTrip;   /* OV_TRIP(0x09) - 过压阈*/
	uint8_t UVTrip;   /* UV_TRIP(0x0A) - 欠压阈*/
	uint8_t CCCfg;    /* CC_CFG(0x0B) - 库仑计配必须x19 */

	/* 电芯电压寄存VC1~VC15, x0C开始连续排*/
	/* 每节电芯字节(高字低字, 14位ADC) */
	union
	{
		struct
		{
			uint8_t VC1_HI;
			uint8_t VC1_LO;
		}VCell1Byte;
		uint16_t VCell1Word;
	}VCell1;

	union
	{
		struct
		{
			uint8_t VC2_HI;
			uint8_t VC2_LO;
		}VCell2Byte;
		uint16_t VCell2Word;
	}VCell2;

	union
	{
		struct
		{
			uint8_t VC3_HI;
			uint8_t VC3_LO;
		}VCell3Byte;
		uint16_t VCell3Word;
	}VCell3;

	union
	{
		struct
		{
			uint8_t VC4_HI;
			uint8_t VC4_LO;
		}VCell4Byte;
		uint16_t VCell4Word;
	}VCell4;

	union
	{
		struct
		{
			uint8_t VC5_HI;
			uint8_t VC5_LO;
		}VCell5Byte;
		uint16_t VCell5Word;
	}VCell5;

	union
	{
		struct
		{
			uint8_t VC6_HI;
			uint8_t VC6_LO;
		}VCell6Byte;
		uint16_t VCell6Word;
	}VCell6;

	union
	{
		struct
		{
			uint8_t VC7_HI;
			uint8_t VC7_LO;
		}VCell7Byte;
		uint16_t VCell7Word;
	}VCell7;

	union
	{
		struct
		{
			uint8_t VC8_HI;
			uint8_t VC8_LO;
		}VCell8Byte;
		uint16_t VCell8Word;
	}VCell8;

	union
	{
		struct
		{
			uint8_t VC9_HI;
			uint8_t VC9_LO;
		}VCell9Byte;
		uint16_t VCell9Word;
	}VCell9;

	union
	{
		struct
		{
			uint8_t VC10_HI;
			uint8_t VC10_LO;
		}VCell10Byte;
		uint16_t VCell10Word;
	}VCell10;

	union
	{
		struct
		{
			uint8_t VC11_HI;
			uint8_t VC11_LO;
		}VCell11Byte;
		uint16_t VCell11Word;
	}VCell11;

	union
	{
		struct
		{
			uint8_t VC12_HI;
			uint8_t VC12_LO;
		}VCell12Byte;
		uint16_t VCell12Word;
	}VCell12;

	union
	{
		struct
		{
			uint8_t VC13_HI;
			uint8_t VC13_LO;
		}VCell13Byte;
		uint16_t VCell13Word;
	}VCell13;

	union
	{
		struct
		{
			uint8_t VC14_HI;
			uint8_t VC14_LO;
		}VCell14Byte;
		uint16_t VCell14Word;
	}VCell14;

	union
	{
		struct
		{
			uint8_t VC15_HI;
			uint8_t VC15_LO;
		}VCell15Byte;
		uint16_t VCell15Word;
	}VCell15;

	/* BAT(0x2A) - 电池总电*/
	union
	{
		struct
		{
			uint8_t BAT_HI;
			uint8_t BAT_LO;
		}VBatByte;
		uint16_t VBatWord;
	}VBat;

