Zhianan-creator/STM32F103-BQ76920-BMS-Firmware/User/Drivers/drv_softi2c_bq769x0.h
	/* TS1(0x2C) - 温度传感(热敏电阻或内部die温度) */
	union
	{
		struct
		{
			uint8_t TS1_HI;
			uint8_t TS1_LO;
		}TS1Byte;
		uint16_t TS1Word;
	}TS1;

	/* TS2(0x2E) - 温度传感(BQ76930/40才有) */
	union
	{
		struct
		{
			uint8_t TS2_HI;
			uint8_t TS2_LO;
		}TS2Byte;
		uint16_t TS2Word;
	}TS2;

	/* TS3 - 温度传感(BQ76940才有) */
	union
	{
		struct
		{
			uint8_t TS3_HI;
			uint8_t TS3_LO;
		}TS3Byte;
		uint16_t TS3Word;
	}TS3;

	/* CC(0x32) - 库仑计采样16位有符号,补码) */
	union
	{
		struct
		{
			uint8_t CC_HI;
			uint8_t CC_LO;
		}CCByte;
		uint16_t CCWord;
	}CC;

	/* ADCGAIN1(0x50) - ADC增益寄存*/
	union
	{
		struct
		{
			uint8_t RSVD1			:2;
			uint8_t ADCGAIN_4_3		:2;  /* 增益的bit4~bit3 */
			uint8_t RSVD2			:4;
		}ADCGain1Bit;
		uint8_t ADCGain1Byte;
	}ADCGain1;

	uint8_t ADCOffset;  /* ADCOFFSET(0x51) - ADC偏移有符*/

	/* ADCGAIN2(0x59) - ADC增益寄存*/
	union
	{
		struct
		{
			uint8_t RSVD			:5;
			uint8_t ADCGAIN_2_0		:3;  /* 增益的bit2~bit0 */
		}ADCGain2Bit;
		uint8_t ADCGain2Byte;
	}ADCGain2;

}RegisterGroup;


/*==========================================================================
 * 保护延时枚举类型
 *
 * 每种保护都有多档延时可延时越长抗干扰能力越强但响应越慢
 *========================================================================*/

/* SCD(短路)延时: 50us~400us, 延时指超过阈值后多久触发保护 */
typedef enum
{
	BQ_SCD_DELAY_50us  = 0x00,
	BQ_SCD_DELAY_100us = 0x01,
	BQ_SCD_DELAY_200us = 0x02,
	BQ_SCD_DELAY_400us = 0x03,
}BQ769X0_SCDDelayTypedef;

/* OCD(过流)延时: 10ms~1280ms */
typedef enum
{
	BQ_OCD_DEALY_10ms	= 0x00,
	BQ_OCD_DELAY_20ms	= 0x01,
	BQ_OCD_DELAY_40ms	= 0x02,
	BQ_OCD_DELAY_80ms	= 0x03,
	BQ_OCD_DELAY_160ms	= 0x04,
	BQ_OCD_DELAY_320ms	= 0x05,
	BQ_OCD_DELAY_640ms	= 0x06,
	BQ_OCD_DELAY_1280ms	= 0x07,
}BQ769X0_OCDDelayTypedef;


/* OV(过压)延时: 1s~8s */
typedef enum
{
	BQ_OV_DELAY_1s	= 0x00,
	BQ_OV_DELAY_2s	= 0x01,
	BQ_OV_DELAY_4s	= 0x02,
	BQ_OV_DELAY_8s	= 0x03,
}BQ769X0_OVDelayTypedef;

/* UV(欠压)延时: 1s~16s */
typedef enum
{
	BQ_UV_DELAY_1s	= 0x00,
	BQ_UV_DELAY_4s	= 0x01,
	BQ_UV_DELAY_8s	= 0x02,
	BQ_UV_DELAY_16s	= 0x03,
}BQ769X0_UVDelayTypedef;


/*==========================================================================
 * 配置数据结构- 用于BQ769X0_Initialize()的参*
 * 包含所有可配置的保护参
 *   SCDDelay/OCDDelay - 短路/过流延时
 *   UVDelay/OVDelay   - 欠压/过压延时
 *   UVPThreshold/OVPThreshold - 欠压/过压阈mV)
 *========================================================================*/
typedef struct
{
	BQ769X0_SCDDelayTypedef SCDDelay;   /* 短路保护延时 */
	BQ769X0_OCDDelayTypedef OCDDelay;   /* 过流保护延时 */
	BQ769X0_UVDelayTypedef UVDelay;     /* 欠压保护延时 */
	BQ769X0_OVDelayTypedef OVDelay;     /* 过压保护延时 */
	uint16_t UVPThreshold;               /* 欠压阈值(mV), 默认为 900mV */
	uint16_t OVPThreshold;               /* 过压阈值(mV), 默认为 200mV */
}BQ769X0_ConfigDataTypedef;


/*
 * BQ硬件报警回调接口
 *
 * 当BQ769X0检测到异常ALERT引脚产生上升* MCU读取SYS_STAT寄存器后,根据置位的标志调用对应的回调函数
 *
 * 这些回调函数由上层BMS业务注册,例如:
 *   AlertOps.ocd = BMS_OCD_Handler;  // 过流时执行保护动*   AlertOps.ov  = BMS_OV_Handler;   // 过压时断开充电MOS
 *
 * 所有回调都可以传NULL(本阶段不实现完整保护策略)
 * 回调在任务上下文中执不在ISR中,所以可以安全地操作I2C
 */
typedef struct
{
	void (*ocd)(void);		/* 放电过流回调 */
	void (*scd)(void);		/* 放电短路回调 */
	void (*ov)(void);		/* 充电过压回调 */
	void (*uv)(void);		/* 放电欠压回调 */
	void (*ovrd)(void);		/* ALERT被外部覆盖回*/
	void (*device)(void);	/* 设备故障回调 */
	void (*cc)(void);		/* 库仑计采样完成回*/
}BQ769X0_AlertOpsTypedef;

/*
 * 初始化数据结构体 - BQ769X0_Initialize()的参*
 * 包含两部
 *   AlertOps  - 报警回调函数(可以全部传NULL)
 *   ConfigData - 保护配置参数
 */
typedef struct
{
	BQ769X0_AlertOpsTypedef AlertOps;    /* 报警回调 */
	BQ769X0_ConfigDataTypedef ConfigData; /* 保护配置 */
}BQ769X0_InitDataTypedef;


/*
 * 充放电控制类* 用于BQ769X0_ControlDSGOrCHG()函数,控制SYS_CTRL2寄存器中的MOS开*/
typedef enum
{
	CHG_CONTROL = 0x01,  /* 充电MOS控制(SYS_CTRL2.bit0) */
	DSG_CONTROL = 0x02   /* 放电MOS控制(SYS_CTRL2.bit1) */
}BQ769X0_ControlTypedef;


/* 状态枚使能/禁用 */
typedef enum
{
	BQ_STATE_ENABLE,
	BQ_STATE_DISABLE
}BQ769X0_StateTypedef;


/*
 * 电芯均衡位图 - 每个bit对应一节物理电*
 * 使用位图而非数组下标,是因为BQ769X0的CELLBAL寄存器本身就是位图格
 *   CELLBAL1(0x01): bit0=1号电bit1=2号 ..., bit4=5号 *   CELLBAL2(0x02): bit0=6号电bit1=7 ..., bit4=10s*   CELLBAL3(0x03): bit0=11号电bit1=12 ..., bit4=15 *
 * 使用示例:
 *   BQ769X0_CellBalanceControl(BQ_CELL_INDEX1 | BQ_CELL_INDEX3, BQ_STATE_ENABLE);
 *   // 同时开号和3号电芯的均衡
 */
typedef enum
{
	BQ_CELL_INDEX1  = 0x0001,  /* bit0: 1号电*/
	BQ_CELL_INDEX2  = 0x0002,  /* bit1: 2号电*/
	BQ_CELL_INDEX3  = 0x0004,  /* bit2: 3号电*/
	BQ_CELL_INDEX4  = 0x0008,  /* bit3: 4号电*/
	BQ_CELL_INDEX5  = 0x0010,  /* bit4: 5号电*/
	BQ_CELL_INDEX6  = 0x0020,  /* bit5: 6号电*/
	BQ_CELL_INDEX7  = 0x0040,  /* bit6: 7号电*/
	BQ_CELL_INDEX8  = 0x0080,  /* bit7: 8号电*/
	BQ_CELL_INDEX9  = 0x0100,  /* bit8: 9号电*/
	BQ_CELL_INDEX10 = 0x0200,  /* bit9: 10号电*/
	BQ_CELL_INDEX11 = 0x0400,  /* bit10: 11号电*/
	BQ_CELL_INDEX12 = 0x0800,  /* bit11: 12号电*/
	BQ_CELL_INDEX13 = 0x1000,  /* bit12: 13号电*/
	BQ_CELL_INDEX14 = 0x2000,  /* bit13: 14号电*/
	BQ_CELL_INDEX15 = 0x4000,  /* bit14: 15号电*/
	BQ_CELL_ALL		= 0x7FFF,  /* 全部电芯 */
}BQ769X0_CellIndexTypedef;


/*==========================================================================
 * 采样数据结构- 存放BQ769X0的实时采样结*
 * 由周期性调用的Update函数填充:
 *   UpdateCellVolt()  -> CellVoltage[]  (每 250ms)
 *   UpdateCurrent()   -> BatteryCurrent (每 250ms)
 *   UpadteBatVolt()   -> BatteryVoltage (每 250ms)
 *   UpdateTsTemp()    -> TsxTemperature[] (每 2s)
 *   UpdateDieTemp()   -> DieTemperature ((每 2s, 未验证
 *
 * 所有电压单V(伏特)
 * 电流单位: A(安培)
 * 温度单位: °C(摄氏
 *========================================================================*/
typedef struct
{
	float CellVoltage[BQ769X0_CELL_MAX];		/* 单节电芯电压数组(单位V) */
	float TsxTemperature[BQ769X0_TMEP_MAX];	/* 温度传感器数单位°C) */
	float BatteryCurrent;	/* 电池包总电流(单位A, 正为充电, 负为放电) */
	float BatteryVoltage;	/* 电池包总电单位V) */
	float DieTemperature;	/* BQ芯片内部温度(单位°C,未验*/
}BQ769X0_SampleDataTypedef;

/* 全局采样数据实例(在drv_softi2c_bq769x0.c中定*/
extern BQ769X0_SampleDataTypedef BQ769X0_SampleData;


/*==========================================================================
 * BQ769X0公开接口函数声明
 *========================================================================*/

/* 底层 I2C 寄存器读写入 API（支CRC 校验*/
bool BQ769X0_WriteBlockWithCRC(uint8_t startAddress, uint8_t *buffer, uint8_t length);
bool BQ769X0_ReadRegisterByteWithCRC(uint8_t Register, uint8_t *data);
bool BQ769X0_ReadBlockWithCRC(uint8_t Register, uint8_t *buffer, uint8_t length);

