Zhianan-creator/STM32F103-BQ76920-BMS-Firmware/User/Drivers/drv_softi2c_bq769x0.h
/*
 * BQ芯片初始- 必须在I2C_BusInitialize()之后调用
 * 功能: 唤醒芯片 -> 读取ADC增益/偏移 -> 配置保护参数 -> 验证寄存* 参数: InitData - 初始化数保护配置+报警回调)
 * 注意: 配置寄存器回读验证失败时会死循环(while(1)),需要检查硬件连*/
void BQ769X0_Initialize(BQ769X0_InitDataTypedef *InitData);

/*
 * 唤醒BQ芯片(从Ship模式)
 * 原理: 在TS1引脚输出高电平脉冲(至少1s), 然后切回输入模式
 */
void BQ769X0_Wakeup(void);

/*
 * 进入Ship模式(超低功
 * 功能: 按照数据手册的序列写入SYS_CTRL1寄存* 注意: 进入Ship后需要通过TS1引脚唤醒
 */
void BQ769X0_EntryShip(void);

/*
 * 负载检* 返回: true=检测到负载, false=未检测到
 * 条件: 充电MOS关闭(CHG_ON=0)且LOAD_PRESENT标志置位
 */
bool BQ769X0_LoadDetect(void);

/*
 * 控制充放电MOS开* 参数:
 *   ControlType - CHG_CONTROL(充电) 或 DSG_CONTROL(放电)
 *   NewState    - BQ_STATE_ENABLE(开) 或 BQ_STATE_DISABLE(关)
 */
bool BQ769X0_ControlDSGOrCHG(BQ769X0_ControlTypedef ControlType, BQ769X0_StateTypedef NewState);

/*
 * 电芯均衡控制
 * 参数:
 *   CellIndex - 电芯位图(可同时指定多BQ_CELL_INDEX1 | BQ_CELL_INDEX3)
 *   NewState  - BQ_STATE_ENABLE(开启均BQ_STATE_DISABLE(关闭均衡)
 * 注意: 芯片不允许相邻电芯同时均上层需要做冲突过滤
 */
void BQ769X0_CellBalanceControl(BQ769X0_CellIndexTypedef CellIndex, BQ769X0_StateTypedef NewState);

/* 周期性采样函在任务中调用) */
void BQ769X0_UpdateCellVolt(void);   /* 更新电芯电压(建议250ms周期) */
void BQ769X0_UpdateTsTemp(void);     /* 更新热敏电阻温度(建议2s周期) */
void BQ769X0_UpdateDieTemp(void);    /* 更新IC内部温度(未验*/
void BQ769X0_UpdateCurrent(void);    /* 更新电池电流(建议250ms周期) */
void BQ769X0_UpadteBatVolt(void);    /* 更新电池总电建议250ms周期) */

/* 保护参数运行时修改函*/
void BQ769X0_SCDDelaySet(BQ769X0_SCDDelayTypedef SCDDelay);
void BQ769X0_OCDDelaySet(BQ769X0_OCDDelayTypedef OCDDelay);
void BQ769X0_UVDelaySet(BQ769X0_UVDelayTypedef UVDelay);
void BQ769X0_OVDelaySet(BQ769X0_OVDelayTypedef OVDelay);
void BQ769X0_UVPThresholdSet(uint16_t UVPThreshold);
void BQ769X0_OVPThresholdSet(uint16_t OVPThreshold);

BQ769X0_SCDDelayTypedef BQ769X0_SCDDelayGet(void);
BQ769X0_OCDDelayTypedef BQ769X0_OCDDelayGet(void);
BQ769X0_UVDelayTypedef BQ769X0_UVDelayGet(void);
BQ769X0_OVDelayTypedef BQ769X0_OVDelayGet(void);
uint16_t BQ769X0_UVPThresholdGet(void);
uint16_t BQ769X0_OVPThresholdGet(void);


/*==========================================================================
 * FreeRTOS适配: 告警处理接口
 *
 * 原RT-Thread版本在HAL_GPIO_EXTI_Callback中直接调用BQ769X0_AlertyHandler(),
 * 该函数会读写I2C寄存器。但在FreeRTOSISR不能执行I2C操作(互斥锁、HAL_GPIO_Init
 * 都不能在中断中使用
 * 解决方案: "ISR设置标志 + 任务处理"
 *   1. ISR BQ769X0_AlertNotifyFromISR() 仅设置volatile标志
 *   2. 任务BQ769X0_ProcessAlert() 检查标读取寄存执行回调
 *
 * 使用方法:
 *   // 在FreeRTOS任务循环
 *   if (BQ769X0_ProcessAlert())
 *   {
 *       // 处理了告读取了SYS_STAT,执行了回清除了状态位)
 *   }
 *========================================================================*/

/*
 * 从ISR中通知有告警事* 功能: 仅设置volatile标志不做任何I2C操作
 * 调用位置: HAL_GPIO_EXTI_Callback() 中断上下
 * 注意: 此函数可以在ISR中安全调仅写一个volatile变量)
 */
void BQ769X0_AlertNotifyFromISR(void);

/*
 * 在任务中处理告警
 * 功能: 检查告警标-> 读取SYS_STAT -> 调用对应回调 -> 清除状态位
 * 返回: true=处理了告false=无待处理告警
 * 调用位置: FreeRTOS任务循环任务上下
 * 注意: 此函数只能在任务中调禁止在ISR中调*/
bool BQ769X0_ProcessAlert(void);


/*
 * 寄存器CRC验证(调试- 读取单个寄存器并打印CRC校验结果
 *
 * 功能: 使用带CRC的方式读取指定寄存器,打印数据和CRC状* 用验证I2C通信链路是否正常,CRC校验是否通过
 *
 * 输出格式:
 *   [BQ] read reg=0x50 data=0xXX crc=ok       (CRC校验通过)
 *   [BQ] read reg=0x50 data=0xXX crc=failed    (CRC校验失败)
 *   [BQ] read reg=0x50 comm=failed             (I2C通信失败)
 *
 * 参数:
 *   reg_addr - 寄存器地址(如ADCGAIN1=0x50)
 *   reg_name - 寄存器名称字符串(用于打印, 如 "ADCGAIN1")
 *
 * 返回: 1=CRC通过, 0=CRC失败或通信失败
 *
 * 注意: 此函数仅用于调试验证,正式代码中不需要调*/
uint8_t BQ769X0_VerifyRegisterCRC(uint8_t reg_addr, const char *reg_name);

void BQ769X0_RegisterAlertTask(TaskHandle_t task_handle);

uint16_t BQ769X0_GetCellVoltageMv(uint8_t index);
uint16_t BQ769X0_GetPackVoltageMv(void);
int32_t BQ769X0_GetCurrentMa(void);
int16_t BQ769X0_GetTemperatureC(uint8_t index);

/* 通用安全关闭：断开 CHG/DSG 并清零均*/
void BQ769X0_ForceSafeOff(void);

/* BQ 总线互斥锁初始化（在 BQ 初始化前调用*/
void BQ769X0_BusLockInit(void);

/* BQ 总线互斥锁获释放（供需要跨多次寄存器操作保持原子性的上层使用*/
void BQ769X0_BusLock(void);
void BQ769X0_BusUnlock(void);

#endif
